anhvanthe/blocks-module-button/cy8cmbr3108/regs.h
/* cy8cmbr3108 Button Driver - (c) 2017 Blocks Wearables Ltd. */

// CONFIG REGS START
#define REG_SENSOR_EN 0x00
#define REG_FSS_EN    0x02
#define REG_TOGGLE_EN 0x04
#define REG_LED_ON_EN 0x06
#define REG_SENSITIVITY_0 0x08
#define REG_SENSITIVITY_1 0x09
#define REG_BASE_THRESHOLD0 0x0C
#define REG_BASE_THRESHOLD1 0x0D
#define REG_FINGER_THRESHOLD2 0x0E
#define REG_FINGER_THRESHOLD3 0x0F
#define REG_FINGER_THRESHOLD4 0x10
#define REG_FINGER_THRESHOLD5 0x11
#define REG_FINGER_THRESHOLD6 0x12
#define REG_FINGER_THRESHOLD7 0x13
#define REG_SENSOR_DEBOUNCE 0x1C
#define REG_BUTTON_HYS 0x1D
#define REG_BUTTON_LBR 0x1F
#define REG_BUTTON_NNT 0x20
#define REG_BUTTON_NT 0x21
#define REG_PROX_EN 0x26
#define REG_PROX_CFG 0x27
#define REG_PROX_CFG2 0x28
#define REG_PROX_TOUCH_TH0 0x2A
#define REG_PROX_TOUCH_TH1 0x2C
#define REG_PROX_RESOLUTION0 0x2E
#define REG_PROX_RESOLUTION1 0x2F
#define REG_PROX_HYS 0x30
#define REG_PROX_LBR 0x32
#define REG_PROX_NNT 0x33
#define REG_PROX_NT 0x34
#define REG_PROX_POSITIVE_TH0 0x35
#define REG_PROX_POSITIVE_TH1 0x36
#define REG_PROX_NEGATIVE_TH0 0x39
#define REG_PROX_NEGATIVE_TH1 0x3A
#define REG_LED_ON_TIME 0x3D
#define REG_BUZZER_CFG 0x3E
#define REG_BUZZER_ON_TIME 0x3F
#define REG_GPO_CFG 0x40
#define REG_PWM_DUTYCYCLE_CFG0 0x41
#define REG_PWM_DUTYCYCLE_CFG1 0x42
#define REG_PWM_DUTYCYCLE_CFG2 0x43
#define REG_PWM_DUTYCYCLE_CFG3 0x44
#define REG_SPO_CFG 0x4C
#define REG_DEVICE_CFG0 0x4D
#define REG_DEVICE_CFG1 0x4E
#define REG_DEVICE_CFG2 0x4F
#define REG_DEVICE_CFG3 0x50
#define REG_I2C_ADDR 0x51
#define REG_REFRESH_CTRL 0x52
#define REG_STATE_TIMEOUT 0x55
#define REG_SCRATCHPAD0 0x7A
#define REG_SCRATCHPAD1 0x7B
#define REG_CONFIG_CRC 0x7E

// CONTROL REGS START
#define REG_GPO_OUTPUT_STATE 0x80
#define REG_SENSOR_ID 0x82
#define REG_CTRL_CMD 0x86

// STATUS REGS START
#define REG_CTRL_CMD_STATUS 0x88
#define REG_CTRL_CMD_ERR 0x89
#define REG_SYSTEM_STATUS 0x8A
#define REG_PREV_CTRL_CMD_CODE 0x8C
#define REG_FAMILY_ID 0x8F
#define REG_DEVICE_ID 0x90
#define REG_DEVICE_REV 0x92
#define REG_CALC_CRC 0x94
#define REG_TOTAL_WORKING_SNS 0x97
#define REG_SNS_CP_HIGH 0x98
#define REG_SNS_VDD_SHORT 0x9A
#define REG_SNS_GND_SHORT 0x9C
#define REG_SNS_SNS_SHORT 0x9E
#define REG_CMOD_SHIELD_TEST 0xA0
#define REG_BUTTON_STAT 0xAA
#define REG_LATCHED_BUTTON_STAT 0xAC
#define REG_PROX_STAT 0xAE
#define REG_LATCHED_PROX_STAT 0xAF
#define REG_SYNC_COUNTER0 0xB9
#define REG_DIFFERENCE_COUNT_SENSOR0 0xBA
#define REG_DIFFERENCE_COUNT_SENSOR1 0xBC
#define REG_DIFFERENCE_COUNT_SENSOR2 0xBE
#define REG_DIFFERENCE_COUNT_SENSOR3 0xC0
#define REG_DIFFERENCE_COUNT_SENSOR4 0xC2
#define REG_DIFFERENCE_COUNT_SENSOR5 0xC4
#define REG_DIFFERENCE_COUNT_SENSOR6 0xC6
#define REG_DIFFERENCE_COUNT_SENSOR7 0xC8
#define REG_GPO_DATA 0xDA
#define REG_SYNC_COUNTER1 0xDB
#define REG_DEBUG_SENSOR_ID 0xDC
#define REG_DEBUG_CP 0xDD
#define REG_DEBUG_DIFFERENCE_COUNT0 0xDE
#define REG_DEBUG_BASELINE0 0xE0
#define REG_DEBUG_RAW_COUNT0 0xE2
#define REG_DEBUG_AVG_RAW_COUNT0 0xE4
#define REG_SYNC_COUNTER2 0xE7
